#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "ru");
	double a, b, v1, v2, s, t, c, min, max, nok,  a1, a2, b1, b2, AA2, c1, c2, B2, C2, A2, del, del1, del2;
	double y, x;
	double maxchislo = 0;
	const float pi = 3.14;
	cout << "№ 1" << endl;
	cout << "Введите количество градусов" << endl;
	cout << "X = "; cin >> x;
	cout << "Количество радиан: " << x << " * 3.14 / 180 = " << x * pi / 180 << endl;
	cout << "_____________________________________________________________________________" << endl;
	cout << "№ 2" << endl;
	cout << "Введите количество радиан" << endl;
	cout << "X = ";
	cin >> x;
	cout << "Количество градусов: " << x << "* 180 / 3.14 = " << x / pi * 180 << endl;
	cout << "_____________________________________________________________________________" << endl;
	cout << "№ 3" << endl;
	cout << "X КГ конфет стоит  ";
	cin >> a;
	cout << "Введите количество Кг ";
	cin >> x;
	cout << "один кг стоит " << a / x << endl;
	cout << "введите кол-во кг" << endl;
	cin >> y;
	cout << y << " Кг конфет стоит: " << y * (a/x) << endl;
	cout << "_____________________________________________________________________________" << endl;
	cout << "№ 4" << endl;
	cout << "скорость первого автомобиля = "; cin >> v1;
	cout << "скорость второго автомобиля = "; cin >> v2;
	cout << "скорость отдаления: v1 + v2 = " << v1 + v2 << endl;
	cout << "Расстояние между машинами(км) = "; cin >> s;
	cout << "количество часов удаления: "; cin >> t;
	cout << "расстояние между ними через " << t << " часов = " << s + t * (v1 + v2) << " км" << endl;
	cout << "_____________________________________________________________________________" << endl;
	cout << "№ 5" << endl;
	cout << "введите коэфф. A и B" << endl;
	cout << "A = "; cin >> a;
	cout << "B = "; cin >> b;
	cout << a << "X + " << b << " = " << -(b / a) << endl;
	cout << "_____________________________________________________________________________" << endl;
	cout << "№ 6" << endl;
	cout << "A1 = "; cin >> a1; 
	cout << "A2 = "; cin >> a2; 
	cout << "B1 = "; cin >> b1;
	cout << "B2 = "; cin >> b2; 
	cout << "C1 = "; cin >> c1;
	cout << "C2 = "; cin >> c2; 

	del = a1 * b2 - a2 * b1;
	del1 = c1 * b2 - c2 * b1;
	del2 = a1 * c2 - a2 * c1;
	cout << "x равен" << del1 / del << endl;
	cout << "y равен" << del2 / del << endl;
	return 0;
}